Revit 2027 API
AssetProperty.IsReadOnly Property
 Identifies if the object is read-only or modifiable. If true, the object may not be modified. If false, the object's contents may be modified.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsReadOnly { get; }
Public ReadOnly Property IsReadOnly As Boolean
	Get
public:
property bool IsReadOnly {
	bool get ();
}
member IsReadOnly : bool with get
Property Value
Boolean
See Also
Reference
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace